MikroElektronika/core_packages/ARM/gcc_clang/startup/toshiba/tmpm343fexbg.S
                adds     r4, #12
                b        .L_loop0
.L_loop0_done:

                ldr      r3, =__zero_table_start__
                ldr      r4, =__zero_table_end__

.L_loop2:
                cmp      r3, r4
                bge      .L_loop2_done
                ldr      r1, [r3]
                ldr      r2, [r3, #4]
                movs     r0, 0

.L_loop2_0:
                subs     r2, #4
                itt      ge
                strge    r0, [r1, r2]
                bge      .L_loop2_0

                adds     r3, #8
                b        .L_loop2
.L_loop2_done:

                bl       _start

                .fnend
                .size    Reset_Handler, . - Reset_Handler

/* The default macro is not used for HardFault_Handler
 * because this results in a poor debug illusion.
 */
                .thumb_func
                .type    HardFault_Handler, %function
                .weak    HardFault_Handler
                .fnstart
HardFault_Handler:
                b        .
                .fnend
                .size    HardFault_Handler, . - HardFault_Handler

                .thumb_func
                .type    Default_Handler, %function
                .weak    Default_Handler
                .fnstart
Default_Handler:
                b        .
                .fnend
                .size    Default_Handler, . - Default_Handler

/* Macro to define default exception/interrupt handlers.
 * Default handler are weak symbols with an endless loop.
 * They can be overwritten by real handlers.
 */
                .macro   Set_Default_Handler  Handler_Name
                .weak    \Handler_Name
                .set     \Handler_Name, Default_Handler
                .endm


/* Default exception/interrupt handler */

                Set_Default_Handler  NMI_Handler
                Set_Default_Handler  MemManage_Handler
                Set_Default_Handler  BusFault_Handler
                Set_Default_Handler  UsageFault_Handler
                Set_Default_Handler  SVC_Handler
                Set_Default_Handler  DebugMon_Handler
                Set_Default_Handler  PendSV_Handler
                Set_Default_Handler  SysTick_Handler

                Set_Default_Handler  INT0_Handler
                Set_Default_Handler  INT1_Handler
                Set_Default_Handler  INT2_Handler
                Set_Default_Handler  INT3_Handler
                Set_Default_Handler  INT4_Handler
                Set_Default_Handler  INT5_Handler
                Set_Default_Handler  INT6_Handler
                Set_Default_Handler  INT7_Handler
                Set_Default_Handler  INT8_Handler
                Set_Default_Handler  INT9_Handler
                Set_Default_Handler  INTA_Handler
                Set_Default_Handler  INTB_Handler
                Set_Default_Handler  INTC_Handler
                Set_Default_Handler  INTD_Handler
                Set_Default_Handler  INTE_Handler
                Set_Default_Handler  INTF_Handler
                Set_Default_Handler  INTPSCASTOP_Handler
                Set_Default_Handler  INTPSCABRK_Handler
                Set_Default_Handler  INTPSCASTEP_Handler
                Set_Default_Handler  INTPSCAII_Handler
                Set_Default_Handler  INTPSCAIA_Handler
                Set_Default_Handler  INTPSCBSTOP_Handler
                Set_Default_Handler  INTPSCBBRK_Handler
                Set_Default_Handler  INTPSCBSTEP_Handler
                Set_Default_Handler  INTPSCBII_Handler
                Set_Default_Handler  INTPSCBIA_Handler
                Set_Default_Handler  INTPSCCSTOP_Handler
                Set_Default_Handler  INTPSCCBRK_Handler
                Set_Default_Handler  INTPSCCSTEP_Handler
                Set_Default_Handler  INTPSCCII_Handler
                Set_Default_Handler  INTPSCCIA_Handler
                Set_Default_Handler  INTPSCDSTOP_Handler
                Set_Default_Handler  INTPSCDBRK_Handler
                Set_Default_Handler  INTPSCDSTEP_Handler
                Set_Default_Handler  INTPSCDII_Handler
                Set_Default_Handler  INTPSCDIA_Handler
                Set_Default_Handler  INTT0RX_Handler
                Set_Default_Handler  INTT0TX_Handler
                Set_Default_Handler  INTT0ERR_Handler
                Set_Default_Handler  INTT1RX_Handler
                Set_Default_Handler  INTT1TX_Handler
                Set_Default_Handler  INTT1ERR_Handler
                Set_Default_Handler  INTT2RX_Handler
                Set_Default_Handler  INTT2TX_Handler
                Set_Default_Handler  INTT2ERR_Handler
                Set_Default_Handler  INTT3RX_Handler
                Set_Default_Handler  INTT3TX_Handler
                Set_Default_Handler  INTT3ERR_Handler
                Set_Default_Handler  INTT4RX_Handler
                Set_Default_Handler  INTT4TX_Handler
                Set_Default_Handler  INTT4ERR_Handler
                Set_Default_Handler  INTUART0_Handler
                Set_Default_Handler  INTRX0_Handler
                Set_Default_Handler  INTTX0_Handler
                Set_Default_Handler  INTI2C_Handler
                Set_Default_Handler  INTADA_Handler
                Set_Default_Handler  INTADB_Handler
                Set_Default_Handler  INTADC_Handler
                Set_Default_Handler  INTADAHP_Handler
                Set_Default_Handler  INTADBHP_Handler
                Set_Default_Handler  INTADCHP_Handler
                Set_Default_Handler  INTEPHC0_Handler
                Set_Default_Handler  INTPHCP0OVF_Handler
                Set_Default_Handler  INTPHCP0PHE_Handler
                Set_Default_Handler  INTPHCP0CY0_Handler
                Set_Default_Handler  INTPHCP0CY1_Handler
                Set_Default_Handler  INTPHCP0CY2_Handler
                Set_Default_Handler  INTPHCP0CY3_Handler
                Set_Default_Handler  INTPHCP0LMT_Handler
                Set_Default_Handler  INTEPHC1_Handler
                Set_Default_Handler  INTPHCP1OVF_Handler
                Set_Default_Handler  INTPHCP1PHE_Handler
                Set_Default_Handler  INTPHCP1CY0_Handler
                Set_Default_Handler  INTPHCP1CY1_Handler
                Set_Default_Handler  INTPHCP1CY2_Handler
                Set_Default_Handler  INTPHCP1CY3_Handler
                Set_Default_Handler  INTPHCP1LMT_Handler
                Set_Default_Handler  INTEPHC2_Handler
                Set_Default_Handler  INTPHCP2OVF_Handler
                Set_Default_Handler  INTPHCP2PHE_Handler
                Set_Default_Handler  INTPHCP2CY0_Handler
                Set_Default_Handler  INTPHCP2CY1_Handler
                Set_Default_Handler  INTPHCP2CY2_Handler
                Set_Default_Handler  INTPHCP2CY3_Handler
                Set_Default_Handler  INTPHCP2LMT_Handler
                Set_Default_Handler  INTTDA0CMP0_Handler
                Set_Default_Handler  INTTDA0CMP1_Handler
                Set_Default_Handler  INTTDA0CMP2_Handler
                Set_Default_Handler  INTTDA0CMP3_Handler
                Set_Default_Handler  INTTDA0CMP4_Handler
                Set_Default_Handler  INTTDA1CMP0_Handler
                Set_Default_Handler  INTTDA1CMP1_Handler
                Set_Default_Handler  INTTDA1CMP2_Handler
                Set_Default_Handler  INTTDA1CMP3_Handler
                Set_Default_Handler  INTTDA1CMP4_Handler
                Set_Default_Handler  INTTDB0CMP0_Handler
                Set_Default_Handler  INTTDB0CMP1_Handler
                Set_Default_Handler  INTTDB0CMP2_Handler
                Set_Default_Handler  INTTDB0CMP3_Handler
                Set_Default_Handler  INTTDB0CMP4_Handler
                Set_Default_Handler  INTTDB1CMP0_Handler
                Set_Default_Handler  INTTDB1CMP1_Handler
                Set_Default_Handler  INTTDB1CMP2_Handler
                Set_Default_Handler  INTTDB1CMP3_Handler
                Set_Default_Handler  INTTDB1CMP4_Handler
                Set_Default_Handler  INTTB0_Handler
                Set_Default_Handler  INTTB1_Handler
                Set_Default_Handler  INTTB2_Handler
                Set_Default_Handler  INTTB3_Handler
                Set_Default_Handler  INTTB4_Handler
                Set_Default_Handler  INTTB5_Handler
                Set_Default_Handler  INTTB6_Handler
                Set_Default_Handler  INTTB7_Handler
                Set_Default_Handler  INTTB8_Handler
                Set_Default_Handler  INTTB9_Handler
                Set_Default_Handler  INTTBA_Handler
                Set_Default_Handler  INTTBB_Handler
                Set_Default_Handler  INTTBC_Handler
                Set_Default_Handler  INTTBD_Handler
                Set_Default_Handler  INTTBE_Handler
                Set_Default_Handler  INTTBF_Handler
                Set_Default_Handler  INTTBCCAP0_Handler
                Set_Default_Handler  INTTBCCAP1_Handler
                Set_Default_Handler  INTTBDCAP0_Handler
                Set_Default_Handler  INTTBDCAP1_Handler
                Set_Default_Handler  INTTBECAP0_Handler
                Set_Default_Handler  INTTBECAP1_Handler
                Set_Default_Handler  INTTBFCAP0_Handler
                Set_Default_Handler  INTTBFCAP1_Handler
                Set_Default_Handler  INTADAM0_Handler
                Set_Default_Handler  INTADAM1_Handler
                Set_Default_Handler  INTADBM0_Handler
                Set_Default_Handler  INTADBM1_Handler
                Set_Default_Handler  INTADCM0_Handler
                Set_Default_Handler  INTADCM1_Handler
                Set_Default_Handler  INTDMACATC_Handler
                Set_Default_Handler  INTDMACAERR_Handler
                Set_Default_Handler  INTDMACBTC_Handler
                Set_Default_Handler  INTDMACBERR_Handler
                Set_Default_Handler  INTDMACCTC_Handler
                Set_Default_Handler  INTDMACCERR_Handler


                .end